#!/usr/bin/env python
__author__ = 'Tony Liu'
# -*- coding: utf-8 -*-
import re

# 用*表示任意个字符（包括0个），
# 用+表示至少一个字符，
# 用?表示0个或1个字符，用
# {n}表示n个字符，用{n,m}表示n-m个字符
# \d可以匹配一个数字，
# \w可以匹配一个字母或数字
# 有特殊字符 用“\”转义
# ^表示行的开头，^\d表示必须以数字开头。
# $表示行的结束，\d$表示必须以数字结束

#匹配一个精确到两位的浮点数
r1 = re.match(r"^[0-9]{0,9}\.[0-9]{2}$","1111.26")
#print(r1)
#匹配电话号码
r2 = re.match(r"^(137|135|138|139)[0-9]{8}$","13712345678")
#print(r2)
#匹配带区号的电话号码 例如+8613888888888
r3 = re.match(r"^\+[0-9]{2}(137|135|138|139)[0-9]{8}$","+8613888888888")
#print(r3)
#包含字母数字“-”的字符串
r4 = re.match(r"^[0-9A-Za-z\-]+$","-8613888-8-8-8888")
#print(r4)
#带区号的座机号码 例如0818-5220269
r5 = re.match(r"^\d{4}\-\d{7}$","1222-2333333")
#print(r5)
#牛牛汽车
r6 = re.match(r"^[\u725b].{0,3}[\u725b]","牛++=牛")
print(r6)

#切分字符串
l1 = re.split(r"\s","a b c d")
#print(l1)
l2 = re.split(r"\s+","a        b c d")
#print(l2)
l3 = re.split(r"[\s\-\=\+\_\,]+","a ,  -=+     b -c+_ d")
#print(l3)

#分组
t = "19:05:30"
m = re.match(r"^(0[0-9]|1[0-9]|2[0-3]|[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9]|[0-9])\:(0[0-9]|1[0-9]|2[0-9]|3[0-9]|4[0-9]|5[0-9]|[0-9])$",t)
#print(m.group(0),"/",m.group(1),"/",m.group(2),"/",m.group(3))

#贪婪匹配
#由于\d+采用贪婪匹配，直接把后面的0全部匹配了，结果0*只能匹配空字符串了。
m1 = re.match(r'^(\d+)(0*)$', '102300').groups()
m2 = re.match(r'^(\d+?)(0*)$', '102300').groups()
#print(m1,m2)

#正则表达式预编译
re_telephone = re.compile(r'^(\d{3})-(\d{3,8})$')
m3 = re_telephone.match('010-12345').groups()
#print(m3)